Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: KG does not authorize or warrant any of its products for use in life support systems, without the specific written consent of ADI Trinamic/Trinamic Motion Control GmbH & Co.
it_it: KG non autorizza né garantisce l'uso dei suoi prodotti nei sistemi di supporto vitale senza lo specifico consenso scritto di ADI Trinamic/Trinamic Motion Control GmbH & Co.

source: KG owns the content of this user manual in its entirety, including but not limited to pictures, logos, trademarks, and resources.
it_it: KG è proprietaria del contenuto di questo manuale utente nella sua interezza, inclusi, a titolo esemplificativo ma non esaustivo, immagini, loghi, marchi commerciali e risorse.

source: KG products are not designed nor intended for use in military or aerospace applications or environments or in automotive applications unless specifically designated for such use by ADI Trinamic/Trinamic Motion Control GmbH & Co.
it_it: I prodotti KG non sono progettati né destinati all'uso in applicazioni o ambienti militari o aerospaziali, né in applicazioni automobilistiche, a meno che non siano specificamente designati per tale uso da ADI Trinamic/Trinamic Motion Control GmbH & Co.

source: KG specific writ-ten consent.
it_it: Consenso scritto specifico di KG.

source: LCD interface: The interface to connect the LCD cable
it_it: LCD interface: Interfaccia per collegare il cavo LCD

source: LSS activate bitrate delay: Sets the delay which is used with the LSS activate bitrate command (for single devices as well as for the entire network).
it_it: LSS activate bitrate delay: Imposta il ritardo utilizzato con il comando di attivazione bitrate LSS (sia per singoli dispositivi che per l'intera rete).

source: LSS fastscan timeout: This is the timeout value needed for the LSS fastscan algorithm.
it_it: LSS fastscan timeout: Questo è il valore di timeout necessario per l'algoritmo LSS fastscan.

source: LVGL configuration file
it_it: File di configurazione di LVGL

source: LVGL documentation
it_it: Documentazione LVGL

source: LVGL graphical library
it_it: Libreria grafica LVGL

source: LVGL official documentation
it_it: Documentazione ufficiale di LVGL

source: Labels
it_it: Etichette

source: Launching the TMCL-IDE
it_it: Avvio di TMCL-IDE

source: Leave Light V2 with native driver installed
it_it: Leave Light V2 con il driver nativo installato

source: Leave the threshold speed at zero first.
it_it: Lasciare prima la velocità di soglia a zero.

source: Library Installation Requirement
it_it: Requisiti per l'Installazione della Libreria

source: Library Name
it_it: Nome della Libreria

source: Life support systems are equipment intended to support or sustain life, and whose failure to perform, when properly used in accordance with instructions provided, can be reasonably expected to result in personal injury or death.
it_it: I sistemi di supporto vitale sono apparecchiature destinate a supportare o sostenere la vita e il cui mancato funzionamento, se utilizzato correttamente e in conformità con le istruzioni fornite, può ragionevolmente causare lesioni personali o morte.

source: Linux use information
it_it: Informazioni sull'uso di Linux

source: List of supported CAN Interfaces (Linux)
it_it: Elenco delle interfacce CAN supportate (Linux)

source: List of supported CAN Interfaces (Windows)
it_it: Elenco delle interfacce CAN supportate (Windows)

source: Lithium battery charge manager chip
it_it: Chip di gestione della carica della batteria al litio

source: Local Commands
it_it: Comandi Locali

source: Local Variables
it_it: Variabili Locali

source: Local Variables: Choose Local Variables to open the Local Variables Window which can be used to inspect and to change the contents of TMCL/PC local variables.
it_it: Local Variables: Selezionare Local Variables per aprire la Local Variables Window, che può essere utilizzata per ispezionare e modificare il contenuto delle variabili locali TMCL/PC.

source: Log CAN messages: This checkbox switches on or off CAN message logging for this port.
it_it: Log CAN messages: Questa checkbox attiva o disattiva la registrazione dei messaggi CAN per questa porta.

source: Log: Logging can be enabled to continuously save the graph data to a CSV file.
it_it: Log: È possibile abilitare il logging per salvare continuamente i dati del grafico in un file CSV.

source: Logarithm Base 10
it_it: Logaritmo in Base 10

source: Logarithm Base 2
it_it: Logaritmo in Base 2

source: Logarithm Base e
it_it: Logaritmo in Base e

source: Manual Y scaling: When automatic Y scaling is turned off, the Y range can be entered here.
it_it: Manual Y scaling: Quando la scala Y automatica è disattivata, è possibile inserire qui l'intervallo Y.

source: Manual tuning
it_it: Regolazione manuale

source: Manufacturer
it_it: Produttore

source: Many TRINAMIC modules are also USB powered, but this will only work for configuring the module.
it_it: Molti moduli TRINAMIC sono alimentati tramite USB, ma questo funziona solo per la configurazione del modulo.

source: Many TRINAMIC modules can also be connected via RS485, RS232 or a TTL level serial interface.
it_it: Molti moduli TRINAMIC possono essere collegati anche tramite interfaccia seriale RS485, RS232 o TTL.

source: Many commands are just put through to the modules, while other commands (for example branch commands) are executed directly on the host computer.
it_it: Molti comandi vengono semplicemente inoltrati ai moduli, mentre altri (ad esempio i comandi di "branch" [diramazione]) vengono eseguiti direttamente sul computer host.

source: Many standard off-the-shelf RS232 and RS485 interfaces can be used.
it_it: È possibile utilizzare molte interfacce RS232 e RS485 standard disponibili in commercio.

source: Many tools from the TMCL section can also be used with CANopen.
it_it: Molti strumenti della sezione TMCL sono utilizzabili anche con CANopen.

source: Many, but not all modules are equipped with a USB interface which is often the easiest way for a first connection to a PC.
it_it: Molti moduli, ma non tutti, sono dotati di un'interfaccia USB, che spesso rappresenta il modo più semplice per una prima connessione a un PC.

source: Max. and Min.: Maximum and minimum values of the y scale of the graph.
it_it: Max. e Min.: Valori massimo e minimo della scala y del grafico.

source: Maybe other CAN interfaces from the same manufacturers will also work with the TMCL-IDE, but have not been tested by TRINAMIC.
it_it: È possibile che altre interfacce CAN degli stessi produttori funzionino con TMCL-IDE, ma non sono state testate da TRINAMIC.

source: Maybe other CAN interfaces from the same manufacturers will also work with the TMCL-IDE, but have not been tested by Trinamic.
it_it: È possibile che altre interfacce CAN degli stessi produttori funzionino con TMCL-IDE, ma non sono state testate da Trinamic.

source: Menu Bar and Status Bar
it_it: Barra dei Menù e Barra di Stato

source: Message filter: When checked, only CAN messages with the reply ID that is set here will be treated as answers from TMCL modules.
it_it: Message filter: Se selezionato, solo i messaggi CAN con l'ID di risposta impostato qui verranno trattati come risposte provenienti dai moduli TMCL.

source: Mix any values from any axes from any module.
it_it: Combina qualsiasi valore da qualsiasi asse di qualsiasi modulo.

source: Mode
it_it: Modalità

source: Mode 0
it_it: Modalità 0

source: Mode 1
it_it: Modalità 1

source: Mode 1 Query 'ch34x_pis*' and 'tty*' once for both connected and unconnected devices ('ch34x_pis*' for SPI/I2C,'tty*' for UART).
it_it: Modalità 1 Query 'ch34x_pis*' e 'tty*' una volta per i dispositivi connessi e non connessi ('ch34x_pis*' per SPI/I2C, 'tty*' per UART).

source: Mode 1 Query 'ch34x_pis*' and 'tty*', can be queried once when the device is connected and once when the device is not connected(('ch34x_pis*' for SPI/I2C,'tty*' for UART)).
it_it: Modalità 1 Query 'ch34x_pis*' e 'tty*', può essere interrogato una volta quando il dispositivo è connesso e una volta quando non è connesso (('ch34x_pis*' per SPI/I2C,'tty*' per UART)).

source: Mode 2
it_it: Modalità 2

source: Mode 2 Query 'hidraw*' once for both connected and unconnected devices.
it_it: Modalità 2 Query 'hidraw*' una volta per i dispositivi connessi e non connessi.

source: Mode 2 Query 'hidraw*', can be queried once when the device is connected and once when the device is not connected.
it_it: Modalità 2 Query 'hidraw*', può essere interrogato una volta quando il dispositivo è connesso e una volta quando non è connesso.

source: Mode 3
it_it: Modalità 3

source: Mode Description
it_it: Descrizione della Modalità

source: Modify COM Port
it_it: Modifica della Porta COM

source: Modify Driver Object
it_it: Modifica dell'Oggetto Driver

source: Module Assignments
it_it: Assegnazioni dei Moduli

source: Module Index Definition
it_it: Definizione dell'Indice del Modulo

source: Module Index Parameter
it_it: Parametro del Modulo Index

source: Modules that are equipped with a CAN interface can also be connected via the CAN bus.
it_it: I moduli dotati di interfaccia CAN possono essere collegati anche tramite il bus CAN.

source: Most changes made here will become effective immediately.
it_it: La maggior parte delle modifiche apportate qui avrà effetto immediato.

source: Most things defined there also apply for TMCL/PC.
it_it: La maggior parte delle definizioni qui contenute si applica anche a TMCL/PC.

source: Mostly it is not necessary to change the module indices.
it_it: Di solito non è necessario modificare gli indici dei moduli.

source: Mostly the default value of 500ms is sufficient, but there may be cases where this timeout value has to be set higher.
it_it: Di solito il valore predefinito di 500 ms è sufficiente, ma in alcuni casi potrebbe essere necessario impostare un valore di timeout più alto.

source: Mostly the module is in bootloader mode then.
it_it: In genere, il modulo è in modalità bootloader.

source: Mostly this will be done automatically by the TMCL-IDE.
it_it: Di solito questa operazione verrà eseguita automaticamente da TMCL-IDE.

source: Motor: All settings that are specific to the motor itself are shown here.
it_it: Motor: Qui vengono visualizzate tutte le impostazioni specifiche del motore.

source: Mouse right click will open a popup menu.
it_it: Clic destro del mouse per aprire un menu popup.

source: Move the cursor to position ① and change it to the recognized device number (move the cursor using 'up, down, left and right keys' -> click 'i' and then modify it -> click 'Esc' after modifying it -> input ':wq' to save and exit).
it_it: Spostare il cursore in posizione ① e modificarlo con il numero del dispositivo riconosciuto (spostare il cursore utilizzando i tasti 'su, giù, sinistra e destra' -> digitare 'i' e quindi modificarlo -> digitare 'Esc' dopo averlo modificato -> digitare ':wq' per salvare e uscire).

source: Multiply
it_it: Moltiplicazione

source: Name
it_it: Nome

source: Name: The name of the object.
it_it: Name: Il nome dell'oggetto.

source: Name: The name of the register (same as in the chip datasheet).
it_it: Name: Il nome del registro (lo stesso del datasheet del chip).

source: Negative decimal numbers are entered with a preceding “-” sign.
it_it: I numeri decimali negativi vengono inseriti con il segno "-" anteposto.

source: New Project
it_it: Nuovo Progetto

source: New State: Use the buttons provided here to switch to a different state.
it_it: New State: Utilizzare i pulsanti forniti qui per passare a uno stato diverso.

source: New: opens an empty editor tab for creating a new file.
it_it: New: apre una scheda dell'editor vuota per la creazione di un nuovo file.

source: Next initialize the ADC, set its resolution and attenuation, and then create the ADC.
it_it: Successivamente, si inizializza l'ADC, se ne impostano la risoluzione e attenuazione, quindi si crea l'ADC.

source: Next, configure the TF card mounting options, including whether to format when mounting fails, the maximum number of files, and the allocation unit size, etc.
it_it: Quindi, configura le opzioni di montaggio della scheda TF, tra cui se formattare in caso di errore di montaggio, il numero massimo di file, la dimensione dell'unità di allocazione, ecc.

source: Next, create and initialize the IO expander, set the pin mode and state, and initialize the GT911 touch screen.
it_it: Successivamente, crea e inizializza l'espansore IO, impostare la modalità e lo stato dei pin e inizializza il touchscreen GT911.

source: Next, format the file system and check if the file has been deleted after formatting.
it_it: Quindi, formatta il file system e verifica se il file è stato eliminato dopo la formattazione.

source: Next, install the console REPL environment for user interaction based on different configuration options.
it_it: In seguito, si installa l'ambiente REPL della console per l'interazione dell'utente in base alle diverse opzioni di configurazione.

source: Next, print "Create RGB LCD bus", create an RGB panel bus object ESP_PanelBus_RGB, configure its pins, width, height, RGB timing frequency and timing parameters, etc., set the bounce buffer size and display the active low flag, and then start the panel bus operation.
it_it: Successivamente, stampa "Create RGB LCD bus", crea un oggetto bus pannello RGB ESP_PanelBus_RGB, configura i suoi pin, larghezza, altezza, frequenza di temporizzazione RGB e parametri di temporizzazione, ecc., imposta la dimensione del buffer di rimbalzo e visualizza il flag di livello basso attivo, quindi avvia il funzionamento del bus pannello.

source: Next, use the extended GPIO pins to handle the TF card, initialize SPI communication, and attempt to mount the TF card.
it_it: Poi, utilizza i pin GPIO estesi per gestire la scheda TF, inizializzare la comunicazione SPI e tentare di montarla.

source: No representations or warranties, either express or implied, of merchantability, fitness for a particular purpose or of any other nature are made hereunder with respect to information/specification or the products to which information refers and no guarantee with respect to compliance to the intended use is given.
it_it: Non si rilasciano dichiarazioni o garanzie, esplicite o implicite, di commerciabilità, idoneità per uno scopo particolare o di qualsiasi altra natura in relazione alle informazioni/specifiche o ai prodotti a cui le informazioni si riferiscono, né si fornisce alcuna garanzia in merito alla conformità all'uso previsto.

source: Non-touch version: 105.4×67.1mm
it_it: Versione non-touch: 105.4×67.1mm

source: Normalize data: Selects if the data is to be normalized to the maximum and minimum scale values or if just the visible part of the graph is to be shown.
it_it: Normalize data: Seleziona se i dati devono essere normalizzati ai valori di scala massimi e minimi o se deve essere visualizzata solo la parte visibile del grafico.

source: Normally it is not used as often but can be helpful after auto tuning to further optimize the P and I parameters if necessary.
it_it: Normalmente non viene utilizzato così spesso, ma può essere utile dopo la regolazione automatica per ottimizzare ulteriormente i parametri P e I, se necessario.

source: Normally leave at default value.
it_it: Normalmente lasciare il valore di default.

source: Normally one can leave this option turned off (default setting).
it_it: Normalmente è possibile lasciare questa opzione disattivata (impostazione predefinita).

source: Normally this setting can be left at zero.
it_it: Normalmente questa impostazione può essere lasciata a zero.

source: Not all TRINAMIC modules support stand-alone TMCL programming.
it_it: Non tutti i moduli TRINAMIC supportano la programmazione TMCL stand-alone.

source: Note that 0x20 is the I2C written address of TF-Luna.
it_it: Notare che 0x20 è l'indirizzo I2C scritto di TF-Luna.

source: Note that storing axis parameters to the NVM is not possible on all modules and not with all axis parameters.
it_it: Si noti che la memorizzazione dei parametri degli assi nella NVM non è possibile su tutti i moduli e non con tutti i parametri degli assi.

source: Note: A serial port exists for all modes except mode 0.
it_it: Nota: Esiste una porta seriale per tutte le modalità tranne la modalità 0.

source: Note: The configuration file of the common chip is stored in "USB-TO-UART-I2C-SPI-JTAG-Demo\Windows\Software\OpenOCD-CH347\scripts\target", you can copy the file to the current folder.
it_it: Nota: Il file di configurazione del chip comune è memorizzato in "USB-TO-UART-I2C-SPI-JTAG-Demo\Windows\Software\OpenOCD-CH347\scripts\target", è possibile copiare il file nella cartella corrente.

source: Note: In the example file, there is a Test folder under the bin file, and there are two files under the folder that correspond to the clockwise and counterclockwise control of the light source by pressing the key under the Open429I-C (Package A).
it_it: Nota: Nel file di esempio, è presente una cartella "Test" sotto il file bin e due file sotto la cartella che corrispondono al controllo orario e antiorario della sorgente luminosa premendo il tasto sotto Open429I-C (Pacchetto A).

source: Note: The demo is modified based on the Raspberry Pi driver OLED demo.
it_it: Nota: La demo è modificata in base alla demo del driver OLED per Raspberry Pi.

source: Notification at end of program: If this option is selected the user will be notified at the end of the TMCL/PC program.
it_it: Notification at end of program: Se questa opzione è selezionata, l'utente riceverà una notifica al termine del programma TMCL/PC.

source: Now you can choose a wizard.
it_it: Ora è possibile scegliere una procedura guidata.

source: Now, choose a CoolStep hysteresis using the hysteresis start and width values.
it_it: Ora, scegliere un'isteresi CoolStep utilizzando i valori di inizio e ampiezza dell'isteresi.

source: Now, set the stallGuard threshold value in such a way that the blue line reaches zero when the motor is being obstructed (stalled).
it_it: Ora, si imposta il valore di soglia di StallGuard in modo che la linea blu raggiunga lo zero quando il motore è bloccato (in stallo).

source: Now, set up the threshold speeds for switching between the different chopper modes.
it_it: Ora, si impostano le velocità di soglia per il passaggio tra le diverse modalità di chopper.

source: Number representation
it_it: Rappresentazione dei numeri

source: Numerical values will be shown as decimal numbers in the left display field and as hexadecimal values in the right display field.
it_it: I valori numerici verranno visualizzati come numeri decimali nel campo di visualizzazione a sinistra e come valori esadecimali nel campo di visualizzazione a destra.

source: OLED_Library_Function.py corresponds to the reference example "../OLED_Module_Code/RaspberryPi/python/lib/waveshare_OLED/OLED_0in96.py", define OLED device initialization, etc.
it_it: OLED_Library_Function.py corrisponde all'esempio di riferimento "../OLED_Module_Code/RaspberryPi/python/lib/waveshare_OLED/OLED_0in96.py", definisce l'inizializzazione del dispositivo OLED, ecc.

source: OPEN : The pin is unconnected an thus floating.
it_it: OPEN : Il pin è scollegato e quindi flottante.

source: Objects changed using the PDO Configurator will also be marked to be saved in the DCF file.
it_it: Anche gli oggetti modificati tramite PDO Configurator verranno contrassegnati per essere salvati nel file DCF.

source: Objects that contain visible strings or octet strings are only shown in the right display field, and a new value can be entered also in the right input field only.
it_it: Gli oggetti che contengono stringhe visibili o stringhe di ottetti vengono visualizzati solo nel campo di visualizzazione destro e un nuovo valore può essere inserito anche solo nel campo di input destro.

source: Observe USB-CAN-A_TOOL further, and you will see the CAN messages sent by ESP32-S3-Touch-LCD-4.3
it_it: Osservare ulteriormente USB-CAN-A_TOOL e si vedranno i messaggi CAN inviati da ESP32-S3-Touch-LCD-4.3

source: Old modules
it_it: Vecchi moduli

source: On Linux, run the TMCL-IDE.sh script either from the command line or by clicking on it.
it_it: Su Linux, si esegue lo script TMCL-IDE.sh dalla riga di comando o cliccandoci sopra.

source: On Windows 32-bit systems:
it_it: Sui sistemi Windows a 32 bit:

source: On Windows 64-bit systems:
it_it: Sui sistemi Windows a 64 bit:

source: On Windows, run the TMCL-IDE simply by choosing the TMCL-IDE entry from the start menu or by double clicking the TMCL-IDE desktop icon or (mainly if you are using the non-install version) by double clicking the TMCL-IDE.exe file.
it_it: Su Windows, si esegue TMCL-IDE semplicemente selezionando la voce TMCL-IDE dal menu Start o con doppio clic sull'icona di TMCL-IDE sul desktop o (soprattutto se si utilizza la versione non installabile) doppio clic sul file TMCL-IDE.exe.

source: On older Linux distributions it may be necessary to prevent the modem manager from controlling the COM ports where the Trinamic modules are connected to.
it_it: Sulle distribuzioni Linux meno recenti, potrebbe essere necessario impedire al gestore del modem di controllare le porte COM a cui sono collegati i moduli Trinamic.

source: On the Board Assignment tab, information about the evaluation boards connected to the Landungsbruecke or Startrampe board is shown.
it_it: Nel tab Board Assignment, vengono visualizzate informazioni sulle evaluation board collegate alla board Landungsbruecke o Startrampe.

source: On the Connection tab of the USB connection window general connection settings can be made:
it_it: Nella scheda Connection della finestra di connessione USB è possibile configurare le impostazioni generali di connessione:

source: On the General tab the states of all additional inputs and outputs of the module are shown.
it_it: Nella scheda General vengono visualizzati gli stati di tutti gli ingressi e le uscite aggiuntivi del modulo.

source: On the High Speed tab it is possible to choose options that become active when the actual speed becomes greater than the high speed threshold value.
it_it: Sul Tab High Speed è possibile scegliere opzioni che si attivano quando la velocità effettiva supera il valore di soglia per l'alta velocità.

source: On the Settings tab you can reset the connected evaluation boards to their reset state and also switch the motor drivers on or off.
it_it: Nel tab Settings è possibile ripristinare le evaluation board collegate allo stato di reset e anche accendere o spegnere i driver del motore.

source: On the SpreadCycle tab, all settings that are specific to the default chopper scheme can be made.
it_it: Sul tab SpreadCycle è possibile configurare tutte le impostazioni specifiche dello schema chopper predefinito.

source: On the TMCL tab all settings are shown as TMCL commands.
it_it: Nel tab TMCL tutte le impostazioni vengono visualizzate come comandi TMCL.

source: On the TMCL tab, all settings made using the Chopper Settings tool are shown as TMCL commands.
it_it: Nel Tab TMCL, tutte le impostazioni effettuate tramite il tool Chopper Settings vengono visualizzate come comandi TMCL.

source: On the Thresholds tab the threshold speeds for switching between different chopper schemes can be set.
it_it: Nel tab Thresholds è possibile impostare le soglie di velocità per il passaggio tra i diversi schemi di chopper.

source: On the left hand side of the register browser you can find a list of all registers.
it_it: Sul lato sinistro del browser dei registri è possibile trovare un elenco di tutti i registri.

source: On the left side of the dialog, all available modules are shown.
it_it: Sul lato sinistro della finestra di dialogo vengono visualizzati tutti i moduli disponibili.
